//=============================================================================
//
// アイテム処理 [item.h]
// Author : GP11A_341_22_田中太陽
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define	ITEM_MAX				(10)	// アイテムの最大数

typedef struct {
	
	D3DXVECTOR3					pos;		// 現在の位置
	int							textureNum; // テクスチャーの番号
	bool						use;		// 使用状態
	D3DXMATRIX					mtxWorld;			// ワールドマトリックス

}ITEM;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitItem(int type);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

ITEM *GetItem(int bno);
void SetItem(D3DXVECTOR3 pos);

#endif
