//=============================================================================
//
// 制限時間処理 [score.h]
// Author : GP11A_341_22_田中太陽 
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_


#define BULLET_HIT			(10)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTime(int type);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);

void AddTime( int add );

#endif
