//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : GP11A_341_22_田中太陽
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_ENTHER				("data/TEXTURE/push_logo.png")	// 読み込むテクスチャファイル名
#define	TEXTURE_BUTTON				("data/TEXTURE/button_a.png")	// 読み込むテクスチャファイル名

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(int type);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);
LPDIRECTSOUNDBUFFER8 *GetTitleSound(void);

#endif
